configXML/Documents/КурсыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КурсыОбучения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПрактическогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПрохождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОбучающегосяОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КартинкиТекстовыхБлоков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТекстовогоБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекстовыеБлоки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаголовокТекстовогоБлока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТекстовогоБлока</Name>
							<Comment>Служебное поле</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныАнкет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configXML/Documents/КурсыОбучения/Forms/ФормаРедактированияТекстовогоБлока/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ЗаголовокТекстовогоБлока,Текст,УникальныйИдентификаторВладельца");
	ИдентификаторТекстовогоБлока = ?(ПустаяСтрока(Параметры.ИдентификаторТекстовогоБлока), 
		Строка(Новый УникальныйИдентификатор()), Параметры.ИдентификаторТекстовогоБлока);
		
	//ДокументЗаписан = ЗначениеЗаполнено(Параметры.КурсОбученияСсылка);
	//
	//Элементы.ГруппаИнформацияОЗапретеРаботыСКартинкой.Видимость = Не ДокументЗаписан;
	//Элементы.ГруппаПраво.Видимость = ДокументЗаписан;
	
	Если Параметры.Свойство("ОписаниеКартинки") И Не ПустаяСтрока(Параметры.ОписаниеКартинки.АдресКартинки) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ОписаниеКартинки, ПолучитьСписокСвойствСтруктурыОписанияКартинки());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ЗаголовокТекстовогоБлока) Тогда
		ОбщегоНазначения.СообщитьПользователю("Установите заголовок.",, "ЗаголовокТекстовогоБлока",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Текст) Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните текстовый блок.",, "Текст",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;     
	
	Если ЗначениеЗаполнено(АдресКартинки) Тогда
		ПоказатьКартинку();
	Иначе
		ВыбратьКартинку();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвойств = "ЗаголовокТекстовогоБлока,Текст,ИдентификаторТекстовогоБлока";
	Результат = Новый Структура(СписокСвойств);
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, СписокСвойств);
	
	ОписаниеКартинки = ПолучитьСтруктуруОписанияКартинки();
	ЗаполнитьЗначенияСвойств(ОписаниеКартинки, ЭтаФорма, ПолучитьСписокСвойствСтруктурыОписанияКартинки());
	Результат.Вставить("ДанныеКартинки", ОписаниеКартинки);
	
	ЭтаФорма.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ВыбратьКартинку()
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
	ПараметрыДиалога.Заголовок = "Выберите изображение";
	ПараметрыДиалога.Фильтр = "Все файлы изображений | *.jpg; *.png; *.bmp";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога, ЭтаФорма.УникальныйИдентификаторВладельца);
	Если ОписаниеФайла <> Неопределено Тогда
		
		ЭтаФорма.АдресКартинки 		= ОписаниеФайла.Адрес;
		ЭтаФорма.ИмяФайла 			= ОписаниеФайла.СсылкаНаФайл.Имя;
		ЭтаФорма.РасширениеФайла 	= ОписаниеФайла.СсылкаНаФайл.Расширение;
		ЭтаФорма.РазмерФайла 		= ОписаниеФайла.СсылкаНаФайл.Размер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПоказатьКартинку()

	ПутьКФайлу = ПолучитьИмяВременногоФайла(ЭтаФорма.РасширениеФайла);
	
	Ждать ПолучитьФайлССервераАсинх(ЭтаФорма.АдресКартинки, ПутьКФайлу);
	
	Попытка
		ЗапуститьПриложениеАсинх(ПутьКФайлу);
	Исключение
		МенеджерОбработкиОшибок = Новый МенеджерОбработкиОшибок();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщенияОбОшибке = "Не удалось открыть файл картинки по причине: " 
			+ МенеджерОбработкиОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке,, АдресКартинки);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруОписанияКартинки()
	
	Результат = Новый Структура();
	
	Результат.Вставить("АдресКартинки", 	"");
	Результат.Вставить("ИмяФайла", 			"");
	Результат.Вставить("РазмерФайла", 		"");
	Результат.Вставить("РасширениеФайла", 	"");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокСвойствСтруктурыОписанияКартинки()
	Возврат "АдресКартинки,ИмяФайла,РазмерФайла,РасширениеФайла";	
КонецФункции

#КонецОбласти
